package com.pingwit.part_9.point_3;

@SuppressWarnings("SpellCheckingInspection")
public class EnumTheory {
    public static void main(String[] args) {
        /*
        Enum (перечисление)
        В своей простейшей форме перечисление представляет собой список именованных констант,
        который определяет новый тип данных и его допустимые значения.
        Таким образом, объект перечисления может содержать только значения, которые были объявлены в списке.
        Другие значения не допускаются. Иными словами, перечисление дает возможность явно указывать
        единственные значения, которые может законно иметь тип данных.
         */
    }
}
