package com.pingwit.part_29.theory;

public class JsonTheory {
    public static void main(String[] args) {
        /*
        JSON (JavaScript Object Notation) - это формат обмена данными, основанный на синтаксисе объектов JavaScript.
        Он является текстовым форматом, легким для чтения как людьми, так и компьютерами.
        JSON часто используется для передачи данных между веб-сервером и клиентом,
        а также между серверами, в API и во многих других сценариях.

        JSON состоит из пар "ключ-значение", где ключи обычно являются строками,
        а значения могут быть строками, числами, логическими значениями, массивами, объектами JSON или null.
        Структура данных JSON может быть вложенной, что означает,
        что объекты могут содержать другие объекты или массивы, и так далее.
         */
    }
}
