package com.pingwit.part_7;

@SuppressWarnings("SpellCheckingInspection")
public class Theory {
    public static void main(String[] args) {
        /*
        Java - это объектно ориентированный язык программирования.

        Q: Что такое класс?
        A: Класс - это основная строительная единица ООП.
        Класс представляет собой шаблон, по которому создаются объекты.

        Q: Как создать объект?
        A: При помощи оператора new

        Q: Что такое конструктор?
        A: Это специальный метод класса, который вызывается про создании объекта (экземпляра класса)
         */
    }
}
